before(() => {
  cy.visit("/");
});

describe("자동차 경주 테스트 step 1", () => {
  it("주어진 횟수 동안 n대의 자동차는 전진 또는 멈출 수 있다.", () => {
    //given
    //when
    //then
  });

  it("자동차에 이름을 부여할 수 있다. 전진하는 자동차를 출력할 때 자동차 이름을 같이 출력한다.", () => {
    //given
    //when
    //then
  });

  it("자동차 이름은 쉼표(,)를 기준으로 구분하며 이름은 5자 이하만 가능하다.", () => {
    //given
    //when
    //then
  });

  it("사용자는 몇 번의 이동을 할 것인지를 입력할 수 있어야 한다.", () => {
    //given
    //when
    //then
  });

  it("전진하는 조건은 0에서 9 사이에서 random 값을 구한 후 random 값이 4 이상일 경우 전진하고, 3 이하의 값이면 멈춘다.", () => {
    //given
    //when
    //then
  });

  it("자동차 경주 게임을 완료한 후 누가 우승했는지를 알려준다. 우승자는 한 명 이상일 수 있다.", () => {
    //given
    //when
    //then
  });

  it("우승자가 여러명일 경우 ,를 이용하여 구분한다.", () => {
    //given
    //when
    //then
  });
});
